// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length >= 3) {
    console.log("Це великий масив, в якому 3 і більше елементи.");
} else {
    console.log("Це маленький масив, в якому менше 3-х елементів.");
}
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
    // Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let num1 = 3;
let num2 = 7;
let num3 = 5;

// знаходимо найбільше, найменше та середнє значення
let max_num = Math.max(num1, num2, num3);
let min_num = Math.min(num1, num2, num3);
let middle_num = num1 + num2 + num3 - max_num - min_num;

console.log(`Середнє число: ${middle_num}`);

// перевірка, чи знаходиться перше число між двома іншими
if (min_num < num1 && num1 < max_num) {
    console.log(`${num1} знаходиться між ${min_num} і ${max_num}`);
} else {
    console.log(`${num1} не знаходиться між ${min_num} і ${max_num}`);
}


